cinema/advanced/backend/views/proyeccion/_form.php

SELECT * FROM `salas` WHERE `disponible`=TRUE
SELECT * FROM `peliculas`
---
<div class="proyeccion-form">

    <?php $form = ActiveForm::begin(); ?>
    <?=
        $form->field($model, 'sala_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Salas::find()->where(['disponible' => true])->all(), 'id', 'id'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione una sala...'],
        'pluginOptions' => [
         'allowClear' => true
                            ],
                      ]);
     ?>

    <?=
        $form->field($model, 'pelicula_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Peliculas::find()->all(), 'id', 'nombre', 'clasificacion'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione una pelicula...'],
        'pluginOptions' => [
         'allowClear' => true
                            ],
                      ]);