cinema/advanced/common/models/Peliculas.php

    public function getContenido()
    {
        $data['portada'] = Contenido::find()->where(['pelicula_id' => $this->id, 'tipo' => 'portada'])->one();
        $data['fondo'] = Contenido::find()->where(['pelicula_id' => $this->id, 'tipo' => 'fondo'])->one();
        $data['trailer'] = Contenido::find()->where(['pelicula_id' => $this->id, 'tipo' => 'trailer'])->one();
        $data['imagenes'] = Contenido::find()->where(['pelicula_id' => $this->id, 'tipo' => 'imagen'])->all();
---
SELECT * FROM `contenido` WHERE (`pelicula_id`=5) AND (`tipo`='portada')
SELECT * FROM `contenido` WHERE (`pelicula_id`=5) AND (`tipo`='fondo')
SELECT * FROM `contenido` WHERE (`pelicula_id`=1) AND (`tipo`='portada')
SELECT * FROM `contenido` WHERE (`pelicula_id`=1) AND (`tipo`='fondo')