cinema/advanced/backend/views/peliculas/_form.php

SELECT * FROM `participantes`
---
/* @var $this yii\web\View */
/* @var $model backend\models\Peliculas */
/* @var $form yii\widgets\ActiveForm */
$participantesList = ArrayHelper::map(Participantes::find()->all(), 'id', 'nombres', 'tipo');