cinema/advanced/backend/models/LoginForm.php

SELECT * FROM `perfil_usuario` WHERE `id`=7
---
    public function login()
    {
        $user = $this->getUser($this->username);
        $profile = PerfilUsuario::findOne($user->id);