cinema/advanced/backend/views/layouts/main.php

SELECT * FROM `perfil_usuario` WHERE `id`=9
---
    <section class="sidebar">
      <!-- Sidebar user panel -->
      <?php if(!Yii::$app->user->isGuest): ?>
        <?php $perfil = PerfilUsuario::findOne(Yii::$app->user->identity->id); ?>