cinema/advanced/frontend/views/layouts/main.php

SELECT * FROM `perfil_usuario` WHERE `id`=9
---
      <div class="navbar-custom-menu">
        <ul class="nav navbar-nav">
        <?php if(!Yii::$app->user->isGuest): ?>
          <?php $perfil = PerfilUsuario::findOne(Yii::$app->user->identity->id); ?>