cinema/advanced/backend/controllers/ParticipantesController.php

SELECT * FROM `participantes` WHERE `id`='1741747'
---
    protected function findModel($id)
    {
        if (($model = Participantes::findOne($id)) !== null) {