cinema/advanced/backend/controllers/PeliculasController.php

    public function actionCreate()
    {
        $model = new Peliculas();
        $modelsContenidos = [new Contenido];
        $modelsRepartos = [new Reparto];
        $modelApiOptions = new ApiOptions();
        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $flag = true;
            $modelApiOptions->load(Yii::$app->request->post());
            $finder = new MovieFinder('e01a182bdeed3afc056d41564eba1bdd', 'es');
            $movie = (empty($modelApiOptions->movieId)) ? null : $finder->getMovieById($modelApiOptions->movieId);
            //echo "Carga modelo POST";
            $transaction = \Yii::$app->db->beginTransaction();
            try{
                //print_r(Yii::$app->request->post());
                //print_r($modelApiOptions);

                if($modelApiOptions->movieInformation && !empty($movie)){
                        //echo "carga movieInformation";
                    $model->descripcion = $movie->tagline;
                    $model->resena = $movie->overview;
                    $model->save(false);
---
INSERT INTO `peliculas` (`nombre`, `clasificacion`, `calificacion`, `duracion`, `descripcion`, `resena`) VALUES ('Blade Runner 2049', 'PGEI18', 4, 152, '', 'Han pasado 30 años desde los acontecimientos ocurridos en Blade Runner (1982). El oficial K (Ryan Gosling), un blade runner caza-replicantes del Departamento de Policía de Los Ángeles, descubre un secreto que ha estado enterrado durante mucho tiempo y que tiene el potencial de llevar a la sociedad al caos. Su investigación le conducirá a la búsqueda del legendario Rick Deckard (Harrison Ford), un antiguo blade runner en paradero desconocido, que lleva desaparecido 30 años.')

                    $peliculaParticipantes = array();
                    $credits = $movie->credits->cast;
                    foreach ($credits as $actor) {
                        $participante = Participantes::find()->where(['nombres' => $actor->name])->orWhere(['id' => $actor->id])->one();
---
SELECT * FROM `participantes` WHERE (`nombres`='Ryan Gosling') OR (`id`=30614)

                    }

                    Yii::$app->db->createCommand()->batchInsert('participantes', ['id', 'nombres', 'tipo', 'fotografia'],$participantes)->execute();
                    Yii::$app->db->createCommand()->batchInsert('reparto', ['pelicula_id', 'participante_id'],$peliculaParticipantes)->execute();
---
INSERT INTO `reparto` (`pelicula_id`, `participante_id`) VALUES (3, 30614), (3, 3), (3, 224513), (3, 104632), (3, 32), (3, 1110405), (3, 1013973), (3, 1120), (3, 543530), (3, 7499), (3, 83854), (3, 1261694), (3, 765), (3, 65829), (3, 587), (3, 544096), (3, 586), (3, 18818), (3, 72482), (3, 1635050), (3, 1148965)

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $modelsContenido = Contenido::find()->where(['pelicula_id' => $id])->all();
        $modelsReparto = Reparto::find()->where(['pelicula_id' => $id])->all();
---
SELECT * FROM `contenido` WHERE `pelicula_id`='4'
SELECT * FROM `reparto` WHERE `pelicula_id`='4'

    protected function findModel($id)
    {
        if (($model = Peliculas::findOne($id)) !== null) {
---
SELECT * FROM `peliculas` WHERE `id`='4'