cinema/advanced/backend/controllers/PeliculasController.php

SELECT * FROM `contenido` WHERE `pelicula_id`='5'
SELECT * FROM `reparto` WHERE `pelicula_id`='5'
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $modelsContenido = Contenido::find()->where(['pelicula_id' => $id])->all();
        $modelsReparto = Reparto::find()->where(['pelicula_id' => $id])->all();

SELECT EXISTS(SELECT * FROM `peliculas` WHERE (`id`=4))
SELECT * FROM `peliculas` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Peliculas::findOne($id)) !== null) {