cinema/advanced/backend/controllers/ProyeccionController.php

    public function actionCreate()
    {
        $model = new Proyeccion();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $movie = Peliculas::findOne($model->pelicula_id);
            $startTime = $model->fecha_funcion;
            $duracion = $movie->duracion + 15; // 15 minutos de espera entre cada pelicula
            $endTime = date('Y-m-d H:i:s', strtotime("+$duracion minutes", strtotime($startTime)));
            /*echo Proyeccion::find()->where(['and', ['sala_id' => $model->sala_id], ['between', 'fecha_funcion', $startTime, $endTime]])->orWhere(['and', ['sala_id' => $model->sala_id], ['between', 'fin_funcion', $startTime, $endTime]])->orWhere(['and', ['sala_id' => $model->sala_id], ['and', ['and', "'fecha_funcion' <= '$startTime'", "'fecha_funcion' <= '$endTime'"], ['and', "'fin_funcion' >= '$startTime'", "'fin_funcion' >= '$endTime'"]]])->createCommand()->getRawSql();
            die();*/
            $comprobar = Proyeccion::find()->where(['and', ['sala_id' => $model->sala_id], ['between', 'fecha_funcion', $startTime, $endTime]])->orWhere(['and', ['sala_id' => $model->sala_id], ['between', 'fin_funcion', $startTime, $endTime]])->orWhere(['and', ['sala_id' => $model->sala_id], ['and', ['and', "'fecha_funcion' <= '$startTime'", "'fecha_funcion' <= '$endTime'"], ['and', "'fin_funcion' >= '$startTime'", "'fin_funcion' >= '$endTime'"]]])->all();
            if(empty($comprobar)){
                $model->fin_funcion = $endTime;
                $model->save();
---
SELECT EXISTS(SELECT * FROM `peliculas` WHERE (`id`='4'))
SELECT * FROM `peliculas` WHERE `id`='4'
SELECT * FROM `proyeccion` WHERE (((`sala_id`='B-03') AND (`fecha_funcion` BETWEEN '2017-10-27 09:00' AND '2017-10-27 11:25:00')) OR ((`sala_id`='B-03') AND (`fin_funcion` BETWEEN '2017-10-27 09:00' AND '2017-10-27 11:25:00'))) OR ((`sala_id`='B-03') AND ((('fecha_funcion' <= '2017-10-27 09:00') AND ('fecha_funcion' <= '2017-10-27 11:25:00')) AND (('fin_funcion' >= '2017-10-27 09:00') AND ('fin_funcion' >= '2017-10-27 11:25:00'))))
INSERT INTO `proyeccion` (`sala_id`, `pelicula_id`, `fecha_funcion`, `precio`, `fin_funcion`) VALUES ('B-03', 4, '2017-10-27 09:00', 100, '2017-10-27 11:25:00')

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $movie = Peliculas::findOne($model->pelicula_id);
---
SELECT EXISTS(SELECT * FROM `peliculas` WHERE (`id`='5'))

    protected function findModel($id)
    {
        if (($model = Proyeccion::findOne($id)) !== null) {
---
SELECT * FROM `proyeccion` WHERE `id`='1'