cinema/advanced/backend/controllers/SalasController.php

    public function actionCreate()
    {
        $model = new Salas();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `salas` (`id`, `disponible`) VALUES ('B-01', 1)

    protected function findModel($id)
    {
        if (($model = Salas::findOne($id)) !== null) {
---
SELECT * FROM `salas` WHERE `id`='B-02'