cinema/advanced/frontend/controllers/PeliculasController.php

    public function actionView($id)
    {
        date_default_timezone_set('America/Mexico_City');
        $inicioSemana = date('Y-m-d H:i:s', strtotime("next hour"));
        $finSemana = date('Y-m-d H:i:s', strtotime("Sunday this week"));
        $model = $this->findModel($id);
        $proyecciones = Proyeccion::find()->where(['pelicula_id' => $id])->andWhere("fecha_funcion>='$inicioSemana' AND fecha_funcion<='$finSemana'")->all();
---
SELECT * FROM `proyeccion` WHERE (`pelicula_id`='1') AND (fecha_funcion>='2017-10-26 16:00:30' AND fecha_funcion<='2017-10-29 00:00:00')

    protected function findModel($id)
    {
        if (($model = Peliculas::findOne($id)) !== null) {
---
SELECT * FROM `peliculas` WHERE `id`='1'