cinema/advanced/frontend/controllers/ProyeccionController.php

    public function actionComprar($id)
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }
        date_default_timezone_set('America/Mexico_City');
    	$model = new PaymentData();
        $proyeccion = $this->findModel($id);
        if($model->load(Yii::$app->request->post()) && $model->items = Yii::$app->request->post('items')){
            \Conekta\Conekta::setApiKey("key_RqhwraedesBnkJEvzjMeKw");
            \Conekta\Conekta::setApiVersion("2.0.0");
            $userprofile = PerfilUsuario::findOne(Yii::$app->user->id);
            $user = User::findOne(Yii::$app->user->id);
            $token = Yii::$app->request->post('token');
            $client = $model->card_name;
            $customer;
            if(empty($userprofile->conekta_id)){
                $customer = $this->createCustomer($user, $userprofile);
                $userprofile->conekta_id = $customer->id;
                $userprofile->save();
---
SELECT * FROM `user` WHERE `id`=9
SELECT * FROM `perfil_usuario` WHERE `id`=1
SELECT * FROM `user` WHERE `id`=1
UPDATE `perfil_usuario` SET `conekta_id`='cus_2hQPoZtCVRcZJCabk' WHERE `id`=1

            $items = $this->arrayLineItem($compras,$lugar);
            $order = $this->createOrder($items,$customer,$amount,$token);
            //die();
            Yii::$app->db->createCommand()->batchInsert('boletos', ['id', 'usuario_id', 'proyeccion_id', 'numero_asiento', 'fila_asiento', 'fecha_compra', 'precio'],$compras)->execute();
---
INSERT INTO `boletos` (`id`, `usuario_id`, `proyeccion_id`, `numero_asiento`, `fila_asiento`, `fecha_compra`, `precio`) VALUES ('bl59e807fb4035e', 1, 1, 7, 'D', '2017-10-18 21:39:03', 100), ('bl59e807fb403c3', 1, 1, 8, 'D', '2017-10-18 21:39:03', 100)

    public function actionGenerarRecibo($id)
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }
        $boleto = Boletos::findOne($id);
---
SELECT * FROM `boletos` WHERE `id`='bl59e807fb403c3'

     protected function findModel($id)
    {
        if (($model = Proyeccion::findOne($id)) !== null) {
---
SELECT * FROM `proyeccion` WHERE `id`='1'