cinema/advanced/frontend/controllers/ProyeccionController.php

    public function actionGenerarRecibo($id)
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }
        $boleto = Boletos::findOne($id);
---
SELECT * FROM `boletos` WHERE `proyeccion_id`=16