cinema/advanced/frontend/controllers/SiteController.php

    public function actionIndex()
    {
        date_default_timezone_set('America/Mexico_City');
        $inicioSemana = date('Y-m-d H:i:s', strtotime("next hour"));
        $finSemana = date('Y-m-d H:i:s', strtotime("Sunday this week"));
        $peliculas = Peliculas::find()->distinct(true)->where("id IN (SELECT pelicula_id FROM proyeccion WHERE fecha_funcion>='$inicioSemana' AND fecha_funcion<='$finSemana')")->limit(4)->all();
---
SELECT DISTINCT * FROM `peliculas` WHERE id IN (SELECT pelicula_id FROM proyeccion WHERE fecha_funcion>='2017-10-18 22:19:52' AND fecha_funcion<='2017-10-22 00:00:00') LIMIT 4

    public function actionProfile()
    {
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $userId = Yii::$app->user->identity->getId();
        $user = User::findOne($userId);
        $profile = PerfilUsuario::findOne($userId);
---
SELECT * FROM `user` WHERE `id`=1
SELECT * FROM `perfil_usuario` WHERE `id`=1